In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings('ignore')

In [2]:
da = pd.read_csv("h1bDataAnalyst.csv", index_col=0)
ds = pd.read_csv("h1bDataScientist.csv", index_col=0)
se = pd.read_csv("h1bSoftwareEngineer.csv", index_col=0)

In [3]:
da['year'] = pd.DatetimeIndex(da['submitDate']).year
ds['year'] = pd.DatetimeIndex(ds['submitDate']).year
se['year'] = pd.DatetimeIndex(se['submitDate']).year

In [4]:
da = da[da.year > 2014]
ds = ds[ds.year > 2014]
se = se[se.year > 2014]

In [5]:
da = da.sort_values('submitDate').reset_index()
ds = ds.sort_values('submitDate').reset_index()
se = se.sort_values('submitDate').reset_index()

In [6]:
da['employer'] = da['employer'].str.lower()
ds['employer'] = ds['employer'].str.lower()
se['employer'] = se['employer'].str.lower()

In [7]:
da.fillna('missing', inplace=True)
ds.fillna('missing', inplace=True)
se.fillna('missing', inplace=True)

In [8]:
print( da.isnull().sum().sum(), ds.isnull().sum().sum(), se.isnull().sum().sum() )

0 0 0

In [9]:
ds.loc[ds['employer'].str.contains('oracle'), 'employer'].unique()

array(['oracle america inc'], dtype=object)

In [10]:
da.employer = da.employer.apply(lambda x: 'amazon' if 'amazon' in x else x)
ds.employer = ds.employer.apply(lambda x: 'amazon' if 'amazon' in x else x)
se.employer = se.employer.apply(lambda x: 'amazon' if 'amazon' in x else x)

da.employer = da.employer.apply(lambda x: 'google' if 'google' in x else x)
ds.employer = ds.employer.apply(lambda x: 'google' if 'google' in x else x)
se.employer = se.employer.apply(lambda x: 'google' if 'google' in x else x)

da.employer = da.employer.apply(lambda x: 'adobe' if 'adobe' in x else x)
ds.employer = ds.employer.apply(lambda x: 'adobe' if 'adobe' in x else x)
se.employer = se.employer.apply(lambda x: 'adobe' if 'adobe' in x else x)

In [11]:
ds[ ds.employer == 'amazon' ].employer

3127     amazon
3463     amazon
3524     amazon
3532     amazon
3534     amazon
          ...
15387    amazon
15398    amazon
15410    amazon
15422    amazon
15449    amazon
Name: employer, Length: 504, dtype: object

In [12]:
da.drop(['index', 'year'], axis=1, inplace=True)
ds.drop(['index', 'year'], axis=1, inplace=True)
se.drop(['index', 'year'], axis=1, inplace=True)

In [13]:
ds.title.unique()

array(['SENIOR DATA SCIENTIST', 'DATA SCIENTIST', 'DATA SCIENTIST 1',
       'SR. DATA SCIENTIST', 'PRINCIPAL DATA SCIENTIST',
       'DATA SCIENTIST II', 'ASSOCIATE DATA SCIENTIST',
       'LEAD DATA SCIENTIST', 'STAFF DATA SCIENTIST', 'DATA SCIENTIST 2',
       'DATA SCIENTIST I', 'JR. DATA SCIENTIST',
       'SR DATA SCIENTIST BL LAB', 'DATA SCIENTIST 3',
       'DATA SCIENTIST III', 'JUNIOR DATA SCIENTIST', 'SR DATA SCIENTIST'],
      dtype=object)

In [14]:
ds_title_map = {
    'JR. DATA SCIENTIST':'Junior Data Scientist',
    'JUNIOR DATA SCIENTIST':'Junior Data Scientist',
    'ASSOCIATE DATA SCIENTIST':'Associate Data Scientist',
    'DATA SCIENTIST':'Data Scientist',
    'SR DATA SCIENTIST':'Senior Data Scientist',
    'SR. DATA SCIENTIST':'Senior Data Scientist',
    'SENIOR DATA SCIENTIST':'Senior Data Scientist',
    'STAFF DATA SCIENTIST':'Staff Data Scientist',
    'PRINCIPAL DATA SCIENTIST':'Principal Data Scientist',
    'LEAD DATA SCIENTIST':'Lead Data Scientist',
    'DATA SCIENTIST 1':'Associate Data Scientist', 
    'DATA SCIENTIST 2':'Data Scientist', 
    'DATA SCIENTIST 3':'Senior Data Scientist',
    'DATA SCIENTIST I':'Associate Data Scientist',
    'DATA SCIENTIST II':'Data Scientist',
    'DATA SCIENTIST III':'Senior Data Scientist'
}

In [15]:
ds['title'] = ds['title'].map(ds_title_map)

In [16]:
ds['title'].unique()

array(['Senior Data Scientist', 'Data Scientist',
       'Associate Data Scientist', 'Principal Data Scientist',
       'Lead Data Scientist', 'Staff Data Scientist',
       'Junior Data Scientist', nan], dtype=object)

In [17]:
se.title.unique()

array(['SENIOR SOFTWARE ENGINEER', 'SOFTWARE ENGINEER',
       'PRINCIPAL SOFTWARE ENGINEER', 'STAFF SOFTWARE ENGINEER',
       'SOFTWARE ENGINEER 3', 'SOFTWARE ENGINEER 2',
       'SOFTWARE ENGINEER II', 'LEAD SOFTWARE ENGINEER',
       'SOFTWARE ENGINEER III', 'ASSOCIATE SOFTWARE ENGINEER',
       'SOFTWARE ENGINEER I', 'SOFTWARE ENGINEER 1',
       'JUNIOR SOFTWARE ENGINEER'], dtype=object)

In [18]:
se_title_map ={
    "JUNIOR SOFTWARE ENGINEER":"Junior Software Engineer",
    "ASSOCIATE SOFTWARE ENGINEER":"Associate Software Engineer",
    "SOFTWARE ENGINEER":"Software Engineer", 
    "SENIOR SOFTWARE ENGINEER":"Senior Software Engineer",
    "STAFF SOFTWARE ENGINEER":"Staff Software Engineer",
    "PRINCIPAL SOFTWARE ENGINEER":"Principal Software Engineer",
    "LEAD SOFTWARE ENGINEER":"Lead Software Engineer",
    "SOFTWARE ENGINEER 1":"Associate Software Engineer", 
    "SOFTWARE ENGINEER 2":"Software Engineer", 
    "SOFTWARE ENGINEER 3":"Senior Software Engineer",
    "SOFTWARE ENGINEER I":"Associate Software Engineer",
    "SOFTWARE ENGINEER II":"Software Engineer",
    "SOFTWARE ENGINEER III":"Senior Software Engineer"
}

In [19]:
se['title'] = se['title'].map(se_title_map)

In [20]:
se.title.unique()

array(['Senior Software Engineer', 'Software Engineer',
       'Principal Software Engineer', 'Staff Software Engineer',
       'Lead Software Engineer', 'Associate Software Engineer',
       'Junior Software Engineer'], dtype=object)

In [21]:
da.title.unique()

array(['SENIOR DATA ANALYST', 'DATA ANALYST', 'PRINCIPAL DATA ANALYST',
       'ASSOCIATE DATA ANALYST', 'DATA ANALYST II', 'JUNIOR DATA ANALYST',
       'DATA ANALYST III', 'DATA ANALYST I', 'LEAD DATA ANALYST',
       'STAFF DATA ANALYST', 'DATA ANALYST 2', 'DATA ANALYST 3',
       'DATA ANALYST 1'], dtype=object)

In [22]:
da_title_map = {
    'JUNIOR DATA ANALYST':'Junior Data Analyst',
    'ASSOCIATE DATA ANALYST':'Associate Data Analyst',
    'DATA ANALYST':'Data Analyst',
    'SENIOR DATA ANALYST':'Senior Data Analyst',
    'STAFF DATA ANALYST':'Staff Data Analyst',
    'PRINCIPAL DATA ANALYST':'Principal Data Analyst',
    'LEAD DATA ANALYST':'Lead Data Analyst',
    'DATA ANALYST 1':'Associate Data Analyst', 
    'DATA ANALYST 2':'Data Analyst', 
    'DATA ANALYST 3':'Senior Data Analyst',
    'DATA ANALYST I':'Associate Data Analyst',
    'DATA ANALYST II':'Data Analyst',
    'DATA ANALYST III':'Senior Data Analyst'
}

In [23]:
da['title'] = da['title'].map(da_title_map)

In [24]:
ds.head()

,employer,title,salary,submitDate,startDate,caseStatus,city,state
0,salesforcecom inc,Senior Data Scientist,180000,2015-01-06,2015-01-19,CERTIFIED,SAN FRANCISCO,CA
1,threatmetrix inc,Data Scientist,5769,2015-01-06,2015-01-26,CERTIFIED,SAN JOSE,CA
2,playdots inc,Data Scientist,100000,2015-01-06,2015-01-13,CERTIFIED,NEW YORK,NY
3,pulsepoint inc,Senior Data Scientist,125000,2015-01-08,2015-01-26,CERTIFIED,NEW YORK,NY
4,twitter inc,Data Scientist,130000,2015-01-09,2015-07-03,CERTIFIED,SAN FRANCISCO,CA

In [25]:
month_map = {
    1:'Jan',
    2:'Feb',
    3:'Mar',
    4:'Apr',
    5:'May',
    6:'Jun',
    7:'Jul',
    8:'Aug',
    9:'Sep',
    10:'Oct',
    11:'Nov',
    12:'Dec'
}

In [26]:
ds.head()

,employer,title,salary,submitDate,startDate,caseStatus,city,state
0,salesforcecom inc,Senior Data Scientist,180000,2015-01-06,2015-01-19,CERTIFIED,SAN FRANCISCO,CA
1,threatmetrix inc,Data Scientist,5769,2015-01-06,2015-01-26,CERTIFIED,SAN JOSE,CA
2,playdots inc,Data Scientist,100000,2015-01-06,2015-01-13,CERTIFIED,NEW YORK,NY
3,pulsepoint inc,Senior Data Scientist,125000,2015-01-08,2015-01-26,CERTIFIED,NEW YORK,NY
4,twitter inc,Data Scientist,130000,2015-01-09,2015-07-03,CERTIFIED,SAN FRANCISCO,CA

In [27]:
ds.sort_values('submitDate')

,employer,title,salary,submitDate,startDate,caseStatus,city,state
0,salesforcecom inc,Senior Data Scientist,180000,2015-01-06,2015-01-19,CERTIFIED,SAN FRANCISCO,CA
1,threatmetrix inc,Data Scientist,5769,2015-01-06,2015-01-26,CERTIFIED,SAN JOSE,CA
2,playdots inc,Data Scientist,100000,2015-01-06,2015-01-13,CERTIFIED,NEW YORK,NY
3,pulsepoint inc,Senior Data Scientist,125000,2015-01-08,2015-01-26,CERTIFIED,NEW YORK,NY
4,twitter inc,Data Scientist,130000,2015-01-09,2015-07-03,CERTIFIED,SAN FRANCISCO,CA
...,...,...,...,...,...,...,...,...
15468,maplebear inc,Data Scientist,150000,2020-12-22,2021-02-08,CERTIFIED,SAN FRANCISCO,CA
15467,anthem inc,Data Scientist,84718,2020-12-22,2021-01-25,CERTIFIED,ATLANTA,GA
15479,bold penguin inc,Data Scientist,112500,2020-12-22,2020-12-31,CERTIFIED,COLUMBUS,OH
15472,freedom financial network llc,Staff Data Scientist,140000,2020-12-22,2021-02-08,CERTIFIED,SAN MATEO,CA
15480,bytedance inc,Data Scientist,185000,2020-12-22,2021-01-04,CERTIFIED,MOUNTAIN VIEW,CA

In [28]:
da.to_csv("h1bDataAnalystCleaned.csv")
ds.to_csv("h1bDataScientistCleaned.csv")
se.to_csv("h1bSoftwareEngineerCleaned.csv")